from .effect_meta import EffectEnum
from .effect_meta import EffectMeta, EffectParam

class AudioSceneEffectType(EffectEnum):
    """剪映自带的音频“场景音”效果类型"""

    # 免费
    _8bit       = EffectMeta("8bit", False, "7161319747584266766", "5723961", "8d24238329ea5c250e33ae241d5adae2", [
                                    EffectParam("change_voice_param_pitch_shift", 0.500, 0.000, 1.000),
                                    EffectParam("change_voice_param_timbre", 1.000, 0.000, 1.000),
                                    EffectParam("change_voice_param_strength", 1.000, 0.000, 1.000)])
    """参数:
        - change_voice_param_pitch_shift: 默认0.50, 0.00 ~ 1.00
        - change_voice_param_timbre: 默认1.00, 0.00 ~ 1.00
        - change_voice_param_strength: 默认1.00, 0.00 ~ 1.00
    """
    低保真      = EffectMeta("低保真", False, "7024390914537689614", "2672762", "7ddbd39a691a66a021f684cab756a89a", [
                                    EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
        - 强弱: 默认1.00, 0.00 ~ 1.00
    """
    合成器      = EffectMeta("合成器", False, "7018011500577034759", "2672753", "394efea5922637bcd8288e0fb3c2372e", [
                                    EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
        - 强弱: 默认1.00, 0.00 ~ 1.00
    """
    回音        = EffectMeta("回音", False, "7018011608408396325", "5723901", "5377f66109693f2d473df5ea6ec8f791", [
                                    EffectParam("change_voice_param_quantity", 0.800, 0.000, 1.000),
                                    EffectParam("change_voice_param_strength", 0.762, 0.000, 1.000)])
    """参数:
        - change_voice_param_quantity: 默认0.80, 0.00 ~ 1.00
        - change_voice_param_strength: 默认0.76, 0.00 ~ 1.00
    """
    扩音器      = EffectMeta("扩音器", False, "7018011975514853924", "2672749", "13169f6ab9957ff005d316239bef0045", [
                                    EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
        - 强弱: 默认1.00, 0.00 ~ 1.00
    """
    水下        = EffectMeta("水下", False, "7106404450444513806", "2673077", "53956694a8b68b2855faa2adc043b5b1", [
                                    EffectParam("深度", 0.500, 0.000, 1.000)])
    """参数:
        - 深度: 默认0.50, 0.00 ~ 1.00
    """
    没电了      = EffectMeta("没电了", False, "7018012193769656845", "2672747", "87f91614bac060840ad5a57ef2b0c9ca", [
                                    EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
        - 强弱: 默认1.00, 0.00 ~ 1.00
    """
    环绕音      = EffectMeta("环绕音", False, "7161319847819743780", "5723960", "fa9a4cb20d3488bf79e176571d5841f5", [
                                    EffectParam("change_voice_param_center_position", 0.500, 0.000, 1.000),
                                    EffectParam("change_voice_param_surrounding_frequency", 0.500, 0.000, 1.000)])
    """参数:
        - change_voice_param_center_position: 默认0.50, 0.00 ~ 1.00
        - change_voice_param_surrounding_frequency: 默认0.50, 0.00 ~ 1.00
    """
    电音        = EffectMeta("电音", False, "7018011438379700773", "2672754", "d893a319d5175d9f09f70ddef1f79980", [
                                    EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
        - 强弱: 默认1.00, 0.00 ~ 1.00
    """
    颤音        = EffectMeta("颤音", False, "7018011370289369637", "2672755", "c5e4874f83337e1cb9f8322fb843c901", [
                                    EffectParam("频率", 0.714, 0.000, 1.000),
                                    EffectParam("幅度", 0.905, 0.000, 1.000)])
    """参数:
        - 频率: 默认0.71, 0.00 ~ 1.00
        - 幅度: 默认0.91, 0.00 ~ 1.00
    """
    麦霸        = EffectMeta("麦霸", False, "7018012141332468260", "2672748", "3eedef5ef82b32912203a1f4fb901182", [
                                    EffectParam("空间大小", 0.052, 0.000, 1.000),
                                    EffectParam("强弱", 0.450, 0.000, 1.000)])
    """参数:
        - 空间大小: 默认0.05, 0.00 ~ 1.00
        - 强弱: 默认0.45, 0.00 ~ 1.00
    """
    黑胶        = EffectMeta("黑胶", False, "7024391411764040205", "2672761", "59e61d687a0f612bfae43bccf770f090", [
                                    EffectParam("强弱", 1.000, 0.000, 1.000),
                                    EffectParam("噪点", 0.743, 0.000, 1.000)])
    """参数:
        - 强弱: 默认1.00, 0.00 ~ 1.00
        - 噪点: 默认0.74, 0.00 ~ 1.00
    """

    # 付费
    _3d环绕音   = EffectMeta("3d环绕音", True, "7350214888242811455", "53187169", "577c3d8e5312012b1d98ba5fc0b206d0", [
                                    EffectParam("强度", 0.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认0.00, 0.00 ~ 1.00
    """
    Autotune    = EffectMeta("Autotune", True, "7360900806851170828", "58979352", "1477f4ca8307e2fa4ee2243d98d8b837", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    下雨        = EffectMeta("下雨", True, "7375069649446113804", "68076030", "83bb223637d5368384c47e3d2b061b62", [
                                    EffectParam("strength", 1.000, 0.000, 1.000),
                                    EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
        - noise: 默认0.74, 0.00 ~ 1.00
    """
    乡村大喇叭  = EffectMeta("乡村大喇叭", True, "7282691036197950009", "23897651", "c996243ac50d235f00e5931e5ecadc52", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    人声增强    = EffectMeta("人声增强", True, "7106404399756349983", "2673078", "626f988dbd2cbd17acaa24d08451e314", [
                                    EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
        - 强弱: 默认1.00, 0.00 ~ 1.00
    """
    低音增强    = EffectMeta("低音增强", True, "7106404304247853604", "2673080", "e7c09c96d10c163269fc4e35c1f4b1ee", [
                                    EffectParam("change_voice_param_strength", 1.000, 0.000, 1.000)])
    """参数:
        - change_voice_param_strength: 默认1.00, 0.00 ~ 1.00
    """
    停车场      = EffectMeta("停车场", True, "7372150242524795446", "66413024", "d2dd515293081a8573485159db5a71e0", [
                                    EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
    """
    冰川之下    = EffectMeta("冰川之下", True, "7375068986829967883", "68076029", "6b9cda93f6d75b9a3b19b2e8eb6ad40f", [
                                    EffectParam("strength", 1.000, 0.000, 1.000),
                                    EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
        - noise: 默认0.74, 0.00 ~ 1.00
    """
    刮风        = EffectMeta("刮风", True, "7375069247275274771", "68076028", "8600891882159f364d8c53e4f703cff4", [
                                    EffectParam("strength", 1.000, 0.000, 1.000),
                                    EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
        - noise: 默认0.74, 0.00 ~ 1.00
    """
    噪音混响    = EffectMeta("噪音混响", True, "7382844688987853349", "72110975", "3b3b09b530b0a64666f1c5b6d20d4018", [
                                    EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
    """
    地狱        = EffectMeta("地狱", True, "7375069113988682281", "68076027", "5ec03c41ada16530949daa4106c85a90", [
                                    EffectParam("strength", 1.000, 0.000, 1.000),
                                    EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
        - noise: 默认0.74, 0.00 ~ 1.00
    """
    复古收音机  = EffectMeta("复古收音机", True, "7350215379714576907", "53187166", "301d642d131aabff7ea8c3b717b36a79", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    失真电子    = EffectMeta("失真电子", True, "7350215296801575443", "53187167", "a1c00df42076ed1bd6a81f2d30b94566", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    对讲机      = EffectMeta("对讲机", True, "7350214704284832275", "53187168", "016dbdb3c786896c92bb936ece11acf6", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    房间        = EffectMeta("房间", True, "7282691385872880165", "23880629", "639f5c0c6b20418aaeb0e144da21151c", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    捂嘴        = EffectMeta("捂嘴", True, "7372405649684042292", "66552320", "9f9a8270c0005a480547d6ddf2a9293a", [
                                    EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
    """
    教堂        = EffectMeta("教堂", True, "7282691146759803429", "23882063", "96dc71756d0025e96a504b42d988b2ac", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    教室        = EffectMeta("教室", True, "7282687783833965113", "23897703", "678c14a6f63f75e03daa062a254081f7", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    机器人2     = EffectMeta("机器人2", True, "7372150541738054156", "66413023", "952f3feddf3555939adbbfd1c1869474", [
                                    EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
    """
    沙漠        = EffectMeta("沙漠", True, "7375069515530375691", "68076025", "099c935428943c9c3662b15b35b1ee36", [
                                    EffectParam("strength", 1.000, 0.000, 1.000),
                                    EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
        - noise: 默认0.74, 0.00 ~ 1.00
    """
    派对        = EffectMeta("派对", True, "7381685442795541042", "71718513", "723386ab87f938779a3369436234d903", [
                                    EffectParam("strength", 1.000, 0.000, 1.000),
                                    EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
        - noise: 默认0.74, 0.00 ~ 1.00
    """
    深海回声    = EffectMeta("深海回声", True, "7350215168413929995", "53187172", "37a16a2dc77540b7d70fe301e482d4f2", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    电话        = EffectMeta("电话", True, "7264894634285863483", "20255003", "5da5a98b8c926c0dcc1c3c8bc3f3012f", [
                                    EffectParam("强弱", 0.700, 0.000, 1.000)])
    """参数:
        - 强弱: 默认0.70, 0.00 ~ 1.00
    """
    留声机      = EffectMeta("留声机", True, "7282687663872676408", "23897797", "e692fae669650c948451b5811a04e7e6", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    百老汇      = EffectMeta("百老汇", True, "7372150379150053907", "66413025", "73e3a35496b9766d0400165844be72f1", [
                                    EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
    """
    空灵感      = EffectMeta("空灵感", True, "7350215092975178252", "53187171", "aa1887a8b3375d20df6bf9438d62083a", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    空谷回声    = EffectMeta("空谷回声", True, "7350214991628210727", "53187170", "9913daa32167a17c1f41ad2f5596c411", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    老式电话    = EffectMeta("老式电话", True, "7282691476843139621", "23880011", "2eb835175e1e72e9d86b09bf513077cf", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    言灵术      = EffectMeta("言灵术", True, "7382844601435951653", "72110974", "7184386e75226a36942c60a5d5bb5618", [
                                    EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
    """
    豪宅回声    = EffectMeta("豪宅回声", True, "7360900963294515775", "58979353", "7c20b5fba991f3188f14d7cdb0de1fa1", [
                                    EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
        - 强度: 默认1.00, 0.00 ~ 1.00
    """
    迷幻电子    = EffectMeta("迷幻电子", True, "7375069381769826879", "68076026", "ce220d25a6f95bd31a81f6421bbf2525", [
                                    EffectParam("strength", 1.000, 0.000, 1.000),
                                    EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
        - strength: 默认1.00, 0.00 ~ 1.00
        - noise: 默认0.74, 0.00 ~ 1.00
    """
