"""音频场景特效元数据"""

from .effect_meta import EffectEnum
from .effect_meta import EffectMeta, EffectParam

class AudioSceneEffectType(EffectEnum):
    """音频"场景音"效果枚举"""

    # 免费特效
    _8bit                = EffectMeta("8bit", False, "7161319747584266766", "5723961", "8d24238329ea5c250e33ae241d5adae2", [
                              EffectParam("change_voice_param_pitch_shift", 0.500, 0.000, 1.000),
                              EffectParam("change_voice_param_timbre", 1.000, 0.000, 1.000),
                              EffectParam("change_voice_param_strength", 1.000, 0.000, 1.000)])
    """参数:
    change_voice_param_pitch_shift: 默认50%, 0% ~ 100%
    change_voice_param_timbre: 默认100%, 0% ~ 100%
    change_voice_param_strength: 默认100%, 0% ~ 100%"""
    低保真               = EffectMeta("低保真", False, "7024390914537689614", "2672762", "7ddbd39a691a66a021f684cab756a89a", [
                              EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
    强弱: 默认100%, 0% ~ 100%"""
    合成器               = EffectMeta("合成器", False, "7018011500577034759", "2672753", "394efea5922637bcd8288e0fb3c2372e", [
                              EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
    强弱: 默认100%, 0% ~ 100%"""
    回音                 = EffectMeta("回音", False, "7018011608408396325", "5723901", "5377f66109693f2d473df5ea6ec8f791", [
                              EffectParam("change_voice_param_quantity", 0.800, 0.000, 1.000),
                              EffectParam("change_voice_param_strength", 0.762, 0.000, 1.000)])
    """参数:
    change_voice_param_quantity: 默认80%, 0% ~ 100%
    change_voice_param_strength: 默认76%, 0% ~ 100%"""
    扩音器               = EffectMeta("扩音器", False, "7018011975514853924", "2672749", "13169f6ab9957ff005d316239bef0045", [
                              EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
    强弱: 默认100%, 0% ~ 100%"""
    水下                 = EffectMeta("水下", False, "7106404450444513806", "2673077", "53956694a8b68b2855faa2adc043b5b1", [
                              EffectParam("深度", 0.500, 0.000, 1.000)])
    """参数:
    深度: 默认50%, 0% ~ 100%"""
    没电了               = EffectMeta("没电了", False, "7018012193769656845", "2672747", "87f91614bac060840ad5a57ef2b0c9ca", [
                              EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
    强弱: 默认100%, 0% ~ 100%"""
    环绕音               = EffectMeta("环绕音", False, "7161319847819743780", "5723960", "fa9a4cb20d3488bf79e176571d5841f5", [
                              EffectParam("change_voice_param_center_position", 0.500, 0.000, 1.000),
                              EffectParam("change_voice_param_surrounding_frequency", 0.500, 0.000, 1.000)])
    """参数:
    change_voice_param_center_position: 默认50%, 0% ~ 100%
    change_voice_param_surrounding_frequency: 默认50%, 0% ~ 100%"""
    电音                 = EffectMeta("电音", False, "7018011438379700773", "2672754", "d893a319d5175d9f09f70ddef1f79980", [
                              EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
    强弱: 默认100%, 0% ~ 100%"""
    颤音                 = EffectMeta("颤音", False, "7018011370289369637", "2672755", "c5e4874f83337e1cb9f8322fb843c901", [
                              EffectParam("频率", 0.714, 0.000, 1.000),
                              EffectParam("幅度", 0.905, 0.000, 1.000)])
    """参数:
    频率: 默认71%, 0% ~ 100%
    幅度: 默认90%, 0% ~ 100%"""
    麦霸                 = EffectMeta("麦霸", False, "7018012141332468260", "2672748", "3eedef5ef82b32912203a1f4fb901182", [
                              EffectParam("空间大小", 0.052, 0.000, 1.000),
                              EffectParam("强弱", 0.450, 0.000, 1.000)])
    """参数:
    空间大小: 默认5%, 0% ~ 100%
    强弱: 默认45%, 0% ~ 100%"""
    黑胶                 = EffectMeta("黑胶", False, "7024391411764040205", "2672761", "59e61d687a0f612bfae43bccf770f090", [
                              EffectParam("强弱", 1.000, 0.000, 1.000),
                              EffectParam("噪点", 0.743, 0.000, 1.000)])
    """参数:
    强弱: 默认100%, 0% ~ 100%
    噪点: 默认74%, 0% ~ 100%"""

    # 付费特效
    _360度环绕音         = EffectMeta("360度环绕音", True, "7410254975328064040", "81298963", "cc1709e1be9bb76d98cf54f28efda236", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    _3d环绕音            = EffectMeta("3d环绕音", True, "7350214888242811455", "53187169", "577c3d8e5312012b1d98ba5fc0b206d0", [
                              EffectParam("强度", 0.000, 0.000, 1.000)])
    """参数:
    强度: 默认0%, 0% ~ 100%"""
    Autotune             = EffectMeta("Autotune", True, "7360900806851170828", "58979352", "1477f4ca8307e2fa4ee2243d98d8b837", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    Livehouse            = EffectMeta("Livehouse", True, "7413661671941476904", "82364386", "d626c7854922c9fabb2a777e40f05aff", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    下雨                 = EffectMeta("下雨", True, "7375069649446113804", "68076030", "0633c88a5d6344a5ac1c00aa05e43d5f", [
                              EffectParam("strength", 1.000, 0.000, 1.000),
                              EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%
    noise: 默认74%, 0% ~ 100%"""
    乡村大喇叭           = EffectMeta("乡村大喇叭", True, "7282691036197950009", "23897651", "c996243ac50d235f00e5931e5ecadc52", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    人声增强             = EffectMeta("人声增强", True, "7106404399756349983", "2673078", "626f988dbd2cbd17acaa24d08451e314", [
                              EffectParam("强弱", 1.000, 0.000, 1.000)])
    """参数:
    强弱: 默认100%, 0% ~ 100%"""
    人声增强3            = EffectMeta("人声增强3", True, "7425556785693463090", "86419033", "9324a8dd6d5f67820bb50577a129a577", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    低保真扩音器         = EffectMeta("低保真扩音器", True, "7467815819540435506", "103845136", "6955de18e7c318f8b0a91c7b06377a69", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    低音增强             = EffectMeta("低音增强", True, "7106404304247853604", "2673080", "e7c09c96d10c163269fc4e35c1f4b1ee", [
                              EffectParam("change_voice_param_strength", 1.000, 0.000, 1.000)])
    """参数:
    change_voice_param_strength: 默认100%, 0% ~ 100%"""
    低音增强2            = EffectMeta("低音增强2", True, "7410254814539420195", "81298965", "b5b8e03035ed0e9bc1d23895366869ff", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    停车场               = EffectMeta("停车场", True, "7372150242524795446", "66413024", "d2dd515293081a8573485159db5a71e0", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    冥想                 = EffectMeta("冥想", True, "7467815749931766322", "103845143", "1785bb1a52982661c7fc475f130d1b7b", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    冰川之下             = EffectMeta("冰川之下", True, "7375068986829967883", "68076029", "6b9cda93f6d75b9a3b19b2e8eb6ad40f", [
                              EffectParam("strength", 1.000, 0.000, 1.000),
                              EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%
    noise: 默认74%, 0% ~ 100%"""
    刮风                 = EffectMeta("刮风", True, "7375069247275274771", "68076028", "33e99402b2b056ce4f44f820ceac5cb5", [
                              EffectParam("strength", 1.000, 0.000, 1.000),
                              EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%
    noise: 默认74%, 0% ~ 100%"""
    午夜电台             = EffectMeta("午夜电台", True, "7431088998652580378", "88155751", "94ce3c12b4f9e72469bccbba9d3c020e", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    噪音混响             = EffectMeta("噪音混响", True, "7382844688987853349", "72110975", "3b3b09b530b0a64666f1c5b6d20d4018", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    回声                 = EffectMeta("回声", True, "7425556970339308083", "86419034", "edbfe18f8479b3da7e091b6d8bb2b592", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    回忆人声             = EffectMeta("回忆人声", True, "7400653027557773865", "78208789", "5a1681f3a09b861ef3e4a65b2f9b794d", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    地狱                 = EffectMeta("地狱", True, "7375069113988682281", "68076027", "5ec03c41ada16530949daa4106c85a90", [
                              EffectParam("strength", 1.000, 0.000, 1.000),
                              EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%
    noise: 默认74%, 0% ~ 100%"""
    复古收音机           = EffectMeta("复古收音机", True, "7350215379714576907", "53187166", "301d642d131aabff7ea8c3b717b36a79", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    复古收音机2          = EffectMeta("复古收音机2", True, "7431088943560397339", "88155750", "ef070459bb3eb2c02b0d65277369424c", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    复古电视             = EffectMeta("复古电视", True, "7431089082647712282", "88155749", "a2e9b297a1acdb997c3f71bb4273bf77", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    失真电子             = EffectMeta("失真电子", True, "7350215296801575443", "53187167", "a1c00df42076ed1bd6a81f2d30b94566", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    宽阔人声             = EffectMeta("宽阔人声", True, "7400653260320674343", "78208785", "8472328fd44653bd18d871357da26dd7", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    对讲机               = EffectMeta("对讲机", True, "7350214704284832275", "53187168", "016dbdb3c786896c92bb936ece11acf6", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    山洞                 = EffectMeta("山洞", True, "7392070412865114659", "75411128", "4335ffa39cfdd4b7635fb6beb49dea80", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    广播                 = EffectMeta("广播", True, "7418519152467382794", "84093261", "d3378900221ac03887cb608f1bae981c", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    延迟回声             = EffectMeta("延迟回声", True, "7425556912709571110", "86419029", "26201a59916f7616c4706788aceee188", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    恐怖音效             = EffectMeta("恐怖音效", True, "7431088801579012645", "88155748", "5e8778aa2e2e8270fba1b5e677b8e5fc", [
                              EffectParam("强度", 1.000, 0.000, 1.000),
                              EffectParam("背景音", 0.500, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%
    背景音: 默认50%, 0% ~ 100%"""
    房间                 = EffectMeta("房间", True, "7282691385872880165", "23880629", "639f5c0c6b20418aaeb0e144da21151c", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    捂嘴                 = EffectMeta("捂嘴", True, "7372405649684042292", "66552320", "9f9a8270c0005a480547d6ddf2a9293a", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    教堂                 = EffectMeta("教堂", True, "7282691146759803429", "23882063", "96dc71756d0025e96a504b42d988b2ac", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    教室                 = EffectMeta("教室", True, "7282687783833965113", "23897703", "678c14a6f63f75e03daa062a254081f7", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    时光扭曲             = EffectMeta("时光扭曲", True, "7410254477246075407", "81298964", "b4abdda11160d663308aeb0dab6063de", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    森林                 = EffectMeta("森林", True, "7413270049080742415", "82210570", "147be719531ade36bd6959338a3caa29", [
                              EffectParam("强度", 1.000, 0.000, 1.000),
                              EffectParam("背景音", 0.500, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%
    背景音: 默认50%, 0% ~ 100%"""
    楼道                 = EffectMeta("楼道", True, "7410254596020376064", "81298960", "c1806a2578d126dd74433640f5e09bab", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    楼道回声             = EffectMeta("楼道回声", True, "7425556847509115401", "86419032", "4e418df9c1cb821c20e10fcf304b7e93", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    氦气                 = EffectMeta("氦气", True, "7400653188803596836", "78208787", "9c59009886c059e20d3914089afbc82f", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    沙漠                 = EffectMeta("沙漠", True, "7375069515530375691", "68076025", "5bd2772879c6273189d3fc7f07581e71", [
                              EffectParam("strength", 1.000, 0.000, 1.000),
                              EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%
    noise: 默认74%, 0% ~ 100%"""
    洞穴回声             = EffectMeta("洞穴回声", True, "7425557093597319689", "86419031", "bec3da95c2b4c70e8e1202972aeaf8e3", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    派对                 = EffectMeta("派对", True, "7381685442795541042", "71718513", "723386ab87f938779a3369436234d903", [
                              EffectParam("strength", 1.000, 0.000, 1.000),
                              EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%
    noise: 默认74%, 0% ~ 100%"""
    浴室                 = EffectMeta("浴室", True, "7392070514686038543", "75411129", "543fa76977e80084f25067c94e4c08a8", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    深海回声             = EffectMeta("深海回声", True, "7350215168413929995", "53187172", "37a16a2dc77540b7d70fe301e482d4f2", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    深邃人声             = EffectMeta("深邃人声", True, "7400653111255110183", "78208786", "1d79f2c0660e1f4a2441255b9e34be6e", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    清澈人声             = EffectMeta("清澈人声", True, "7410254648440787456", "81298967", "b99fbb6dd42a759572f4ba13efb516ae", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    演唱会               = EffectMeta("演唱会", True, "7413661596611777076", "82364387", "8ceb67756bd822b7ee9728903c8e3efa", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    演讲舞台             = EffectMeta("演讲舞台", True, "7431088715092464155", "88155747", "6452fbaa8d66c01c491fc6d5816afc77", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    环绕回声             = EffectMeta("环绕回声", True, "7425557028694659635", "86419030", "0fe55903f86c3fdad33275b04c04cba0", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    电台播音             = EffectMeta("电台播音", True, "7418519267659747877", "84093262", "752c3df02caa20b12bfa3154ed025bff", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    电话                 = EffectMeta("电话", True, "7264894634285863483", "20255003", "5da5a98b8c926c0dcc1c3c8bc3f3012f", [
                              EffectParam("强弱", 0.700, 0.000, 1.000)])
    """参数:
    强弱: 默认70%, 0% ~ 100%"""
    留声机               = EffectMeta("留声机", True, "7282687663872676408", "23897797", "e692fae669650c948451b5811a04e7e6", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    百老汇               = EffectMeta("百老汇", True, "7372150379150053907", "66413025", "73e3a35496b9766d0400165844be72f1", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    空灵感               = EffectMeta("空灵感", True, "7350215092975178252", "53187171", "aa1887a8b3375d20df6bf9438d62083a", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    空谷回声             = EffectMeta("空谷回声", True, "7350214991628210727", "53187170", "9913daa32167a17c1f41ad2f5596c411", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    立体声               = EffectMeta("立体声", True, "7418519209996456498", "84093260", "4381314f6906919781ea17c0d51f36a0", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    管道                 = EffectMeta("管道", True, "7410254536234766863", "81298962", "37233b9d5efed3324a4c6a9d05831f40", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    老式电话             = EffectMeta("老式电话", True, "7282691476843139621", "23880011", "2eb835175e1e72e9d86b09bf513077cf", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    蚊子变声             = EffectMeta("蚊子变声", True, "7467815685876355622", "103845137", "b34cc53f1adf2f9decb0111a0082eb0a", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    言灵术               = EffectMeta("言灵术", True, "7382844601435951653", "72110974", "7184386e75226a36942c60a5d5bb5618", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    豪宅回声             = EffectMeta("豪宅回声", True, "7360900963294515775", "58979353", "7c20b5fba991f3188f14d7cdb0de1fa1", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    超市广播             = EffectMeta("超市广播", True, "7431088660709118514", "88155744", "14a9154302878be941c993ff6dfd0f3d", [
                              EffectParam("强度", 1.000, 0.000, 1.000),
                              EffectParam("背景音", 0.500, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%
    背景音: 默认50%, 0% ~ 100%"""
    超级混响             = EffectMeta("超级混响", True, "7400652941318689299", "78208790", "c1a87e3affc5c812609b4eded7609e81", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    超重低音             = EffectMeta("超重低音", True, "7410254867232461364", "81298961", "db9c654a48e01c71bfb097d70d21a42d", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    迷幻                 = EffectMeta("迷幻", True, "7410254415921156643", "81298966", "1f549f0d21a5e7729268e6d443857364", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    迷幻电子             = EffectMeta("迷幻电子", True, "7375069381769826879", "68076026", "65ef01ba4626318fab4f007fec136e1e", [
                              EffectParam("strength", 1.000, 0.000, 1.000),
                              EffectParam("noise", 0.743, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%
    noise: 默认74%, 0% ~ 100%"""
    闷响                 = EffectMeta("闷响", True, "7413269872307606016", "82210571", "8d966ef5950315b96dcd02bfc511d5e0", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    震撼全景音           = EffectMeta("震撼全景音", True, "7400653333456753163", "78208788", "1b65723d3e25e82a3ab99af289728498", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    音乐厅               = EffectMeta("音乐厅", True, "7404798608395997723", "79701150", "e819bbe1cd586bd9a2118ca39758ac22", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    颤抖电音             = EffectMeta("颤抖电音", True, "7467815889602089523", "103845138", "8fbf024a96e0c659e8b3d3ca975f1042", [
                              EffectParam("强度", 1.000, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%"""
    马路边               = EffectMeta("马路边", True, "7413269976628335119", "82210569", "1c0c1e3be5ead093b685f451033de74e", [
                              EffectParam("强度", 1.000, 0.000, 1.000),
                              EffectParam("背景音", 0.500, 0.000, 1.000)])
    """参数:
    强度: 默认100%, 0% ~ 100%
    背景音: 默认50%, 0% ~ 100%"""
    高解析人声           = EffectMeta("高解析人声", True, "7410254695169528355", "81298968", "3bcf82243ef574064bb53f99a2f59d5d", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
    高音增强             = EffectMeta("高音增强", True, "7410254923037676047", "81298959", "59b5cc1fc51c2557d9d20e0d7494edc8", [
                              EffectParam("strength", 1.000, 0.000, 1.000)])
    """参数:
    strength: 默认100%, 0% ~ 100%"""
